#### `terraform plan` Success
<details><summary>Show Output</summary>

```
  + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # module.infrastructure.module.elasticsearch.random_password.fluent_elasticsearch_password will be created
  + resource "random_password" "fluent_elasticsearch_password" {
      + id          = (known after apply)
      + length      = 32
      + lower       = true
      + min_lower   = 0
      + min_numeric = 10
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # module.infrastructure.module.elasticsearch.random_password.kibana_encryption_key will be created
  + resource "random_password" "kibana_encryption_key" {
      + id          = (known after apply)
      + length      = 32
      + lower       = true
      + min_lower   = 0
      + min_numeric = 10
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # module.infrastructure.module.elasticsearch.random_password.language_service_elasticsearch_password will be created
  + resource "random_password" "language_service_elasticsearch_password" {
      + id          = (known after apply)
      + length      = 32
      + lower       = true
      + min_lower   = 0
      + min_numeric = 10
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # module.infrastructure.module.kubernetes_cluster_infrastructure.digitalocean_database_cluster.api_mysql will be destroyed
  - resource "digitalocean_database_cluster" "api_mysql" {
      - database     = "defaultdb" -> null
      - engine       = "mysql" -> null
      - host         = "foreign-language-reader-do-user-1516704-0.db.ondigitalocean.com" -> null
      - id           = "9773e3f6-9131-454f-b9f7-ac6cd1fb8c9e" -> null
      - name         = "foreign-language-reader" -> null
      - node_count   = 1 -> null
      - password     = (sensitive value)
      - port         = 25060 -> null
      - private_host = "private-foreign-language-reader-do-user-1516704-0.db.ondigitalocean.com" -> null
      - private_uri  = (sensitive value)
      - region       = "sfo2" -> null
      - size         = "db-s-1vcpu-1gb" -> null
      - tags         = [] -> null
      - uri          = (sensitive value)
      - urn          = "do:dbaas:9773e3f6-9131-454f-b9f7-ac6cd1fb8c9e" -> null
      - user         = "doadmin" -> null
      - version      = "8" -> null
    }

  # module.infrastructure.module.kubernetes_cluster_infrastructure.digitalocean_database_db.api_database will be destroyed
  - resource "digitalocean_database_db" "api_database" {
      - cluster_id = "9773e3f6-9131-454f-b9f7-ac6cd1fb8c9e" -> null
      - id         = "9773e3f6-9131-454f-b9f7-ac6cd1fb8c9e/database/foreign-language-reader" -> null
      - name       = "foreign-language-reader" -> null
    }

  # module.infrastructure.module.kubernetes_cluster_infrastructure.digitalocean_database_firewall.allow_kubernetes will be destroyed
  - resource "digitalocean_database_firewall" "allow_kubernetes" {
      - cluster_id = "9773e3f6-9131-454f-b9f7-ac6cd1fb8c9e" -> null
      - id         = "9773e3f6-9131-454f-b9f7-ac6cd1fb8c9e-20200314054619647200000002" -> null

      - rule {
          - created_at = "2020-03-15T08:15:55Z" -> null
          - type       = "k8s" -> null
          - uuid       = "45e6183f-6245-4f60-a5ec-4474ba3a9032" -> null
          - value      = "9329c2de-f4e2-4f80-be4c-16fefb26477e" -> null
        }
    }

  # module.infrastructure.module.kubernetes_cluster_infrastructure.digitalocean_database_user.api_user will be destroyed
  - resource "digitalocean_database_user" "api_user" {
      - cluster_id        = "9773e3f6-9131-454f-b9f7-ac6cd1fb8c9e" -> null
      - id                = "9773e3f6-9131-454f-b9f7-ac6cd1fb8c9e/user/api" -> null
      - mysql_auth_plugin = "caching_sha2_password" -> null
      - name              = "api" -> null
      - password          = (sensitive value)
      - role              = "normal" -> null
    }

  # module.infrastructure.module.kubernetes_cluster_infrastructure.digitalocean_record.api will be destroyed
  - resource "digitalocean_record" "api" {
      - domain   = "foreignlanguagereader.com" -> null
      - flags    = 0 -> null
      - fqdn     = "api.foreignlanguagereader.com" -> null
      - id       = "92828281" -> null
      - name     = "api" -> null
      - port     = 0 -> null
      - priority = 0 -> null
      - ttl      = 1800 -> null
      - type     = "A" -> null
      - value    = "138.197.236.201" -> null
      - weight   = 0 -> null
    }

  # module.infrastructure.module.kubernetes_cluster_infrastructure.digitalocean_record.kibana will be destroyed
  - resource "digitalocean_record" "kibana" {
      - domain   = "foreignlanguagereader.com" -> null
      - flags    = 0 -> null
      - fqdn     = "kibana.foreignlanguagereader.com" -> null
      - id       = "93327541" -> null
      - name     = "kibana" -> null
      - port     = 0 -> null
      - priority = 0 -> null
      - ttl      = 1800 -> null
      - type     = "A" -> null
      - value    = "138.197.236.201" -> null
      - weight   = 0 -> null
    }

  # module.infrastructure.module.kubernetes_cluster_infrastructure.digitalocean_record.language will be destroyed
  - resource "digitalocean_record" "language" {
      - domain   = "foreignlanguagereader.com" -> null
      - flags    = 0 -> null
      - fqdn     = "language.foreignlanguagereader.com" -> null
      - id       = "92828280" -> null
      - name     = "language" -> null
      - port     = 0 -> null
      - priority = 0 -> null
      - ttl      = 1800 -> null
      - type     = "A" -> null
      - value    = "138.197.236.201" -> null
      - weight   = 0 -> null
    }

  # module.infrastructure.module.kubernetes_cluster_infrastructure.kubernetes_secret.api_database_credentials will be destroyed
  - resource "kubernetes_secret" "api_database_credentials" {
      - data = (sensitive value)
      - id   = "default/api-database-credentials" -> null
      - type = "Opaque" -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "api-database-credentials" -> null
          - namespace        = "default" -> null
          - resource_version = "1768" -> null
          - self_link        = "/api/v1/namespaces/default/secrets/api-database-credentials" -> null
          - uid              = "b50b66f4-a892-45f8-985b-847736b0aa00" -> null
        }
    }

  # module.infrastructure.module.kubernetes_config.helm_release.elasticsearch will be destroyed
  - resource "helm_release" "elasticsearch" {
      - atomic                = false -> null
      - chart                 = "elasticsearch" -> null
      - cleanup_on_fail       = false -> null
      - dependency_update     = false -> null
      - disable_crd_hooks     = false -> null
      - disable_webhooks      = false -> null
      - force_update          = false -> null
      - id                    = "elasticsearch" -> null
      - max_history           = 0 -> null
      - metadata              = [
          - {
              - chart     = "elasticsearch"
              - name      = "elasticsearch"
              - namespace = "default"
              - revision  = 1
              - values    = jsonencode(
                    {
                      - esConfig       = {
                          - elasticsearch.yml = <<~EOT
                                xpack.security.enabled: true
                                xpack.security.transport.ssl.enabled: true
                                xpack.security.transport.ssl.verification_mode: certificate
                                xpack.security.transport.ssl.key: /usr/share/elasticsearch/config/certs/private_key_pem.crt
                                xpack.security.transport.ssl.certificate: /usr/share/elasticsearch/config/certs/certificate_pem.crt
                                xpack.security.transport.ssl.certificate_authorities: [ "/usr/share/elasticsearch/config/certs/issuer_pem.crt" ]
                            EOT
                        }
                      - extraEnvs      = [
                          - {
                              - name      = "ELASTIC_PASSWORD"
                              - valueFrom = {
                                  - secretKeyRef = {
                                      - key  = "password"
                                      - name = "elastic-credentials"
                                    }
                                }
                            },
                          - {
                              - name      = "ELASTIC_USERNAME"
                              - valueFrom = {
                                  - secretKeyRef = {
                                      - key  = "username"
                                      - name = "elastic-credentials"
                                    }
                                }
                            },
                        ]
                      - readinessProbe = {
                          - failureThreshold    = 5
                          - initialDelaySeconds = 30
                          - periodSeconds       = 10
                          - successThreshold    = 3
                          - timeoutSeconds      = 5
                        }
                      - secretMounts   = [
                          - {
                              - name       = "elastic-certificates"
                              - path       = "/usr/share/elasticsearch/config/certs"
                              - secretName = "elasticsearch-certificates"
                            },
                        ]
                    }
                )
              - version   = "7.6.1"
            },
        ] -> null
      - name                  = "elasticsearch" -> null
      - namespace             = "default" -> null
      - recreate_pods         = false -> null
      - render_subchart_notes = true -> null
      - replace               = false -> null
      - repository            = "https://helm.elastic.co" -> null
      - reset_values          = false -> null
      - reuse_values          = false -> null
      - skip_crds             = false -> null
      - status                = "deployed" -> null
      - timeout               = 300 -> null
      - values                = [
          - <<~EOT
                esConfig:
                  elasticsearch.yml: |
                    xpack.security.enabled: true
                    xpack.security.transport.ssl.enabled: true
                    xpack.security.transport.ssl.verification_mode: certificate
                    xpack.security.transport.ssl.key: /usr/share/elasticsearch/config/certs/private_key_pem.crt
                    xpack.security.transport.ssl.certificate: /usr/share/elasticsearch/config/certs/certificate_pem.crt
                    xpack.security.transport.ssl.certificate_authorities: [ "/usr/share/elasticsearch/config/certs/issuer_pem.crt" ]
                
                extraEnvs:
                  - name: ELASTIC_PASSWORD
                    valueFrom:
                      secretKeyRef:
                        name: elastic-credentials
                        key: password
                  - name: ELASTIC_USERNAME
                    valueFrom:
                      secretKeyRef:
                        name: elastic-credentials
                        key: username
                
                readinessProbe:
                  failureThreshold: 5
                  initialDelaySeconds: 30
                  periodSeconds: 10
                  successThreshold: 3
                  timeoutSeconds: 5
                
                secretMounts:
                  - name: elastic-certificates
                    secretName: elasticsearch-certificates
                    path: /usr/share/elasticsearch/config/certs
            EOT,
        ] -> null
      - verify                = false -> null
      - version               = "7.6.1" -> null
      - wait                  = true -> null
    }

  # module.infrastructure.module.kubernetes_config.helm_release.fluentd_elasticsearch will be destroyed
  - resource "helm_release" "fluentd_elasticsearch" {
      - atomic                = false -> null
      - chart                 = "fluentd-elasticsearch" -> null
      - cleanup_on_fail       = false -> null
      - dependency_update     = false -> null
      - disable_crd_hooks     = false -> null
      - disable_webhooks      = false -> null
      - force_update          = false -> null
      - id                    = "fluentd" -> null
      - max_history           = 0 -> null
      - metadata              = [
          - {
              - chart     = "fluentd-elasticsearch"
              - name      = "fluentd"
              - namespace = "logging"
              - revision  = 1
              - values    = jsonencode(
                    {
                      - elasticsearch = {
                          - auth = {
                              - enabled  = true
                              - password = "171X08VW4400f6AEKyZ2MKu7SR6cY5Dv"
                              - user     = "fluentd"
                            }
                          - host = "elasticsearch-master.default.svc.cluster.local"
                        }
                    }
                )
              - version   = "6.2.2"
            },
        ] -> null
      - name                  = "fluentd" -> null
      - namespace             = "logging" -> null
      - recreate_pods         = false -> null
      - render_subchart_notes = true -> null
      - replace               = false -> null
      - repository            = "https://kiwigrid.github.io" -> null
      - reset_values          = false -> null
      - reuse_values          = false -> null
      - skip_crds             = false -> null
      - status                = "deployed" -> null
      - timeout               = 300 -> null
      - values                = [
          - <<~EOT
                elasticsearch:
                  auth:
                    enabled: true
                    user: fluentd
                  host: elasticsearch-master.default.svc.cluster.local
            EOT,
        ] -> null
      - verify                = false -> null
      - version               = "6.2.2" -> null
      - wait                  = true -> null

      - set_sensitive {
          - name  = "elasticsearch.auth.password" -> null
          - value = (sensitive value)
        }
    }

  # module.infrastructure.module.kubernetes_config.helm_release.kibana will be destroyed
  - resource "helm_release" "kibana" {
      - atomic                = false -> null
      - chart                 = "kibana" -> null
      - cleanup_on_fail       = false -> null
      - dependency_update     = false -> null
      - disable_crd_hooks     = false -> null
      - disable_webhooks      = false -> null
      - force_update          = false -> null
      - id                    = "kibana" -> null
      - max_history           = 0 -> null
      - metadata              = [
          - {
              - chart     = "kibana"
              - name      = "kibana"
              - namespace = "default"
              - revision  = 1
              - values    = jsonencode(
                    {
                      - extraEnvs    = [
                          - {
                              - name      = "ELASTICSEARCH_USERNAME"
                              - valueFrom = {
                                  - secretKeyRef = {
                                      - key  = "username"
                                      - name = "elastic-credentials"
                                    }
                                }
                            },
                          - {
                              - name      = "ELASTICSEARCH_PASSWORD"
                              - valueFrom = {
                                  - secretKeyRef = {
                                      - key  = "password"
                                      - name = "elastic-credentials"
                                    }
                                }
                            },
                          - {
                              - name      = "KIBANA_ENCRYPTION_KEY"
                              - valueFrom = {
                                  - secretKeyRef = {
                                      - key  = "encryptionkey"
                                      - name = "elastic-credentials"
                                    }
                                }
                            },
                        ]
                      - kibanaConfig = {
                          - kibana.yml = <<~EOT
                                xpack.security.encryptionKey: ${KIBANA_ENCRYPTION_KEY}
                            EOT
                        }
                    }
                )
              - version   = "7.6.1"
            },
        ] -> null
      - name                  = "kibana" -> null
      - namespace             = "default" -> null
      - recreate_pods         = false -> null
      - render_subchart_notes = true -> null
      - replace               = false -> null
      - repository            = "https://helm.elastic.co" -> null
      - reset_values          = false -> null
      - reuse_values          = false -> null
      - skip_crds             = false -> null
      - status                = "deployed" -> null
      - timeout               = 300 -> null
      - values                = [
          - <<~EOT
                extraEnvs:
                  - name: 'ELASTICSEARCH_USERNAME'
                    valueFrom:
                      secretKeyRef:
                        name: elastic-credentials
                        key: username
                  - name: 'ELASTICSEARCH_PASSWORD'
                    valueFrom:
                      secretKeyRef:
                        name: elastic-credentials
                        key: password
                  - name: 'KIBANA_ENCRYPTION_KEY'
                    valueFrom:
                      secretKeyRef:
                        name: elastic-credentials
                        key: encryptionkey
                
                kibanaConfig:
                  kibana.yml: |
                    xpack.security.encryptionKey: ${KIBANA_ENCRYPTION_KEY}
            EOT,
        ] -> null
      - verify                = false -> null
      - version               = "7.6.1" -> null
      - wait                  = true -> null
    }

  # module.infrastructure.module.kubernetes_config.helm_release.nginx_ingress will be destroyed
  - resource "helm_release" "nginx_ingress" {
      - atomic                = false -> null
      - chart                 = "nginx-ingress" -> null
      - cleanup_on_fail       = false -> null
      - dependency_update     = false -> null
      - disable_crd_hooks     = false -> null
      - disable_webhooks      = false -> null
      - force_update          = false -> null
      - id                    = "nginx-ingress" -> null
      - max_history           = 0 -> null
      - metadata              = [
          - {
              - chart     = "nginx-ingress"
              - name      = "nginx-ingress"
              - namespace = "default"
              - revision  = 1
              - values    = "null"
              - version   = "1.33.0"
            },
        ] -> null
      - name                  = "nginx-ingress" -> null
      - namespace             = "default" -> null
      - recreate_pods         = false -> null
      - render_subchart_notes = true -> null
      - replace               = false -> null
      - repository            = "https://kubernetes-charts.storage.googleapis.com/" -> null
      - reset_values          = false -> null
      - reuse_values          = false -> null
      - skip_crds             = false -> null
      - status                = "deployed" -> null
      - timeout               = 300 -> null
      - verify                = false -> null
      - version               = "1.33.0" -> null
      - wait                  = true -> null
    }

  # module.infrastructure.module.kubernetes_config.helm_release.spark will be destroyed
  - resource "helm_release" "spark" {
      - atomic                = false -> null
      - chart                 = "spark" -> null
      - cleanup_on_fail       = false -> null
      - dependency_update     = false -> null
      - disable_crd_hooks     = false -> null
      - disable_webhooks      = false -> null
      - force_update          = false -> null
      - id                    = "spark" -> null
      - max_history           = 0 -> null
      - metadata              = [
          - {
              - chart     = "spark"
              - name      = "spark"
              - namespace = "content"
              - revision  = 1
              - values    = "null"
              - version   = "1.2.10"
            },
        ] -> null
      - name                  = "spark" -> null
      - namespace             = "content" -> null
      - recreate_pods         = false -> null
      - render_subchart_notes = true -> null
      - replace               = false -> null
      - repository            = "https://charts.bitnami.com/bitnami" -> null
      - reset_values          = false -> null
      - reuse_values          = false -> null
      - skip_crds             = false -> null
      - status                = "deployed" -> null
      - timeout               = 300 -> null
      - verify                = false -> null
      - version               = "1.2.10" -> null
      - wait                  = true -> null
    }

  # module.infrastructure.module.kubernetes_config.kubernetes_namespace.content will be destroyed
  - resource "kubernetes_namespace" "content" {
      - id = "content" -> null

      - metadata {
          - annotations      = {
              - "name" = "content"
            } -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "content" -> null
          - resource_version = "572360" -> null
          - self_link        = "/api/v1/namespaces/content" -> null
          - uid              = "777148ff-880a-4941-886c-abf36d489aa0" -> null
        }
    }

  # module.infrastructure.module.kubernetes_config.kubernetes_namespace.logging will be destroyed
  - resource "kubernetes_namespace" "logging" {
      - id = "logging" -> null

      - metadata {
          - annotations      = {
              - "name" = "logging"
            } -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "logging" -> null
          - resource_version = "521395" -> null
          - self_link        = "/api/v1/namespaces/logging" -> null
          - uid              = "dc755755-7b8a-4da6-a40f-2c3fda33a648" -> null
        }
    }

  # module.infrastructure.module.kubernetes_config.kubernetes_secret.api_secret_key_base will be destroyed
  - resource "kubernetes_secret" "api_secret_key_base" {
      - data = (sensitive value)
      - id   = "default/api-secret-key-base" -> null
      - type = "Opaque" -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "api-secret-key-base" -> null
          - namespace        = "default" -> null
          - resource_version = "1773" -> null
          - self_link        = "/api/v1/namespaces/default/secrets/api-secret-key-base" -> null
          - uid              = "282fec2f-f805-44d9-bfaa-9120c296d2d3" -> null
        }
    }

  # module.infrastructure.module.kubernetes_config.kubernetes_secret.elastic_credentials will be destroyed
  - resource "kubernetes_secret" "elastic_credentials" {
      - data = (sensitive value)
      - id   = "default/elastic-credentials" -> null
      - type = "Opaque" -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "elastic-credentials" -> null
          - namespace        = "default" -> null
          - resource_version = "513312" -> null
          - self_link        = "/api/v1/namespaces/default/secrets/elastic-credentials" -> null
          - uid              = "50816e82-d492-4ac8-8095-2a84b312163a" -> null
        }
    }

  # module.infrastructure.module.kubernetes_config.kubernetes_secret.elasticsearch_internal_certificate will be destroyed
  - resource "kubernetes_secret" "elasticsearch_internal_certificate" {
      - data = (sensitive value)
      - id   = "default/elasticsearch-certificates" -> null
      - type = "Opaque" -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "elasticsearch-certificates" -> null
          - namespace        = "default" -> null
          - resource_version = "134907" -> null
          - self_link        = "/api/v1/namespaces/default/secrets/elasticsearch-certificates" -> null
          - uid              = "14a3ca34-acfa-469e-8de4-6332effb2791" -> null
        }
    }

  # module.infrastructure.module.kubernetes_config.kubernetes_secret.language_service_elastic_credentials will be destroyed
  - resource "kubernetes_secret" "language_service_elastic_credentials" {
      - data = (sensitive value)
      - id   = "default/language-service-elastic-credentials" -> null
      - type = "Opaque" -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "language-service-elastic-credentials" -> null
          - namespace        = "default" -> null
          - resource_version = "847309" -> null
          - self_link        = "/api/v1/namespaces/default/secrets/language-service-elastic-credentials" -> null
          - uid              = "92b31c99-7d12-4326-9e47-0c0475614644" -> null
        }
    }

  # module.infrastructure.module.kubernetes_config.kubernetes_secret.local_connection_token will be destroyed
  - resource "kubernetes_secret" "local_connection_token" {
      - data = (sensitive value)
      - id   = "default/local-connection-token" -> null
      - type = "Opaque" -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "local-connection-token" -> null
          - namespace        = "default" -> null
          - resource_version = "1767" -> null
          - self_link        = "/api/v1/namespaces/default/secrets/local-connection-token" -> null
          - uid              = "b10f3df0-fd36-46f6-90f9-a9025c3f691c" -> null
        }
    }

  # module.infrastructure.module.kubernetes_config.kubernetes_secret.local_connection_token_content will be destroyed
  - resource "kubernetes_secret" "local_connection_token_content" {
      - data = (sensitive value)
      - id   = "content/local-connection-token" -> null
      - type = "Opaque" -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "local-connection-token" -> null
          - namespace        = "content" -> null
          - resource_version = "1106241" -> null
          - self_link        = "/api/v1/namespaces/content/secrets/local-connection-token" -> null
          - uid              = "943ebeb4-e96c-4c7e-b86e-42b066db43f3" -> null
        }
    }

  # module.infrastructure.module.kubernetes_config.kubernetes_secret.nginx_certificate will be destroyed
  - resource "kubernetes_secret" "nginx_certificate" {
      - data = (sensitive value)
      - id   = "default/nginx-certificate" -> null
      - type = "kubernetes.io/tls" -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "nginx-certificate" -> null
          - namespace        = "default" -> null
          - resource_version = "122272" -> null
          - self_link        = "/api/v1/namespaces/default/secrets/nginx-certificate" -> null
          - uid              = "73a23f80-ccb7-46ef-8e5a-a80a5847c936" -> null
        }
    }

  # module.infrastructure.module.kubernetes_config.kubernetes_secret.refresh_definitions_elastic_credentials will be destroyed
  - resource "kubernetes_secret" "refresh_definitions_elastic_credentials" {
      - data = (sensitive value)
      - id   = "content/refresh-definitions-elastic-credentials" -> null
      - type = "Opaque" -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "refresh-definitions-elastic-credentials" -> null
          - namespace        = "content" -> null
          - resource_version = "1106243" -> null
          - self_link        = "/api/v1/namespaces/content/secrets/refresh-definitions-elastic-credentials" -> null
          - uid              = "314fa20e-0d19-43cb-8dd7-9a1d831ad6b4" -> null
        }
    }

  # module.infrastructure.module.kubernetes_config.random_password.api_secret_key_base will be destroyed
  - resource "random_password" "api_secret_key_base" {
      - id          = "none" -> null
      - length      = 64 -> null
      - lower       = true -> null
      - min_lower   = 0 -> null
      - min_numeric = 0 -> null
      - min_special = 0 -> null
      - min_upper   = 0 -> null
      - number      = true -> null
      - result      = (sensitive value)
      - special     = true -> null
      - upper       = true -> null
    }

  # module.infrastructure.module.kubernetes_config.random_password.elasticsearch_password will be destroyed
  - resource "random_password" "elasticsearch_password" {
      - id          = "none" -> null
      - length      = 32 -> null
      - lower       = true -> null
      - min_lower   = 0 -> null
      - min_numeric = 10 -> null
      - min_special = 0 -> null
      - min_upper   = 0 -> null
      - number      = true -> null
      - result      = (sensitive value)
      - special     = false -> null
      - upper       = true -> null
    }

  # module.infrastructure.module.kubernetes_config.random_password.fluent_elasticsearch_password will be destroyed
  - resource "random_password" "fluent_elasticsearch_password" {
      - id          = "none" -> null
      - length      = 32 -> null
      - lower       = true -> null
      - min_lower   = 0 -> null
      - min_numeric = 10 -> null
      - min_special = 0 -> null
      - min_upper   = 0 -> null
      - number      = true -> null
      - result      = (sensitive value)
      - special     = false -> null
      - upper       = true -> null
    }

  # module.infrastructure.module.kubernetes_config.random_password.kibana_encryption_key will be destroyed
  - resource "random_password" "kibana_encryption_key" {
      - id          = "none" -> null
      - length      = 32 -> null
      - lower       = true -> null
      - min_lower   = 0 -> null
      - min_numeric = 10 -> null
      - min_special = 0 -> null
      - min_upper   = 0 -> null
      - number      = true -> null
      - result      = (sensitive value)
      - special     = false -> null
      - upper       = true -> null
    }

  # module.infrastructure.module.kubernetes_config.random_password.language_service_elasticsearch_password will be destroyed
  - resource "random_password" "language_service_elasticsearch_password" {
      - id          = "none" -> null
      - length      = 32 -> null
      - lower       = true -> null
      - min_lower   = 0 -> null
      - min_numeric = 10 -> null
      - min_special = 0 -> null
      - min_upper   = 0 -> null
      - number      = true -> null
      - result      = (sensitive value)
      - special     = false -> null
      - upper       = true -> null
    }

  # module.infrastructure.module.kubernetes_config.random_password.local_connection_token will be destroyed
  - resource "random_password" "local_connection_token" {
      - id          = "none" -> null
      - length      = 64 -> null
      - lower       = true -> null
      - min_lower   = 0 -> null
      - min_numeric = 0 -> null
      - min_special = 0 -> null
      - min_upper   = 0 -> null
      - number      = true -> null
      - result      = (sensitive value)
      - special     = true -> null
      - upper       = true -> null
    }

  # module.infrastructure.module.kubernetes_config.random_password.refresh_definitions_elasticsearch_password will be destroyed
  - resource "random_password" "refresh_definitions_elasticsearch_password" {
      - id          = "none" -> null
      - length      = 32 -> null
      - lower       = true -> null
      - min_lower   = 0 -> null
      - min_numeric = 10 -> null
      - min_special = 0 -> null
      - min_upper   = 0 -> null
      - number      = true -> null
      - result      = (sensitive value)
      - special     = false -> null
      - upper       = true -> null
    }

  # module.infrastructure.module.language_service.kubernetes_horizontal_pod_autoscaler.example will be created
  + resource "kubernetes_horizontal_pod_autoscaler" "example" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "language-service"
          + namespace        = "default"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + max_replicas                      = 10
          + min_replicas                      = 2
          + target_cpu_utilization_percentage = 75

          + scale_target_ref {
              + kind = "Deployment"
              + name = "language-service"
            }
        }
    }

  # module.infrastructure.module.language_service.kubernetes_service.api will be created
  + resource "kubernetes_service" "api" {
      + id                    = (known after apply)
      + load_balancer_ingress = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "language-service"
          + namespace        = "default"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + cluster_ip                  = (known after apply)
          + external_traffic_policy     = (known after apply)
          + publish_not_ready_addresses = false
          + selector                    = {
              + "app" = "language-service"
            }
          + session_affinity            = "None"
          + type                        = "ClusterIP"

          + port {
              + node_port   = (known after apply)
              + port        = 8000
              + protocol    = "TCP"
              + target_port = (known after apply)
            }
        }
    }

  # module.infrastructure.module.nginx_ingress.data.kubernetes_service.nginx will be read during apply
  # (config refers to values not yet known)
 <= data "kubernetes_service" "nginx"  {
      + id                    = (known after apply)
      + load_balancer_ingress = (known after apply)
      + spec                  = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "nginx-ingress-controller"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.infrastructure.module.nginx_ingress.helm_release.nginx_ingress will be created
  + resource "helm_release" "nginx_ingress" {
      + atomic                     = false
      + chart                      = "nginx-ingress"
      + cleanup_on_fail            = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "nginx-ingress"
      + namespace                  = "default"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://kubernetes-charts.storage.googleapis.com/"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "1.33.0"
      + wait                       = true
    }

  # module.infrastructure.module.nginx_ingress.kubernetes_secret.nginx_certificate will be created
  + resource "kubernetes_secret" "nginx_certificate" {
      + data = (sensitive value)
      + id   = (known after apply)
      + type = "kubernetes.io/tls"

      + metadata {
          + generation       = (known after apply)
          + name             = "nginx-certificate"
          + namespace        = "default"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 32 to add, 0 to change, 31 to destroy.
```

</details>

*Workflow: `Test infrastructure plan`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`, Workspace: `default`*
